{"sections":{"main":{"type":"main-page","disabled":true,"settings":{"show_title":true,"page_width":"xs"}},"image_with_text_affiliate_eFpYVx":{"type":"image-with-text-affiliate","settings":{"logo_image":"shopify:\/\/shop_images\/Nobl_Logos.svg","heading_text":"Become a Nobl Affiliate","subheading_text":"<p>Join our affiliate program and unlock the opportunity to earn substantial commissions by promoting Nobl products.<\/p>","affiliate_button_text":"Apply Now","affiliate_link":"shopify:\/\/pages\/contact","agency_button_text":"","agency_link":"shopify:\/\/pages\/contact","main_image":"shopify:\/\/shop_images\/tipdilz7wysq-5ljdlLx4yikUyj1jgkZM0B.png","image_alt_text":"affiliation-image"}},"faq_affiliate_3Qnxci":{"type":"faq-affiliate","blocks":{"faq_item_hznGCV":{"type":"faq_item","settings":{"faq_question":"How does the TikTok For Business Affiliate Program work?","faq_answer":"The TikTok For Business Affiliate Program allows affiliates to earn a commission when driving new users to use TikTok For Business. All affiliates must apply and join the program through Impact. Once you sign in or create an Impact account, let us know by contacting affiliates@tiktok.com and sharing your account ID number. Your account will go through our standard approval process. Once accepted into the program, you will have access to promote TikTok for Business and can start earning a commission (a flat-fee bounty) on conversions that you drive through your website\/social channels. In your Impact account, you will be able to create your own affiliate links that have unique tracking automatically tied to your account – this way, when a conversion comes through, the Impact system will attribute it to you.","button-url":"","button-text":""}},"faq_item_GJD7D4":{"type":"faq_item","settings":{"faq_question":"How can I share my affiliate links?","faq_answer":"How you choose to promote TikTok For Business is up to you. You know your audience better than anyone, so we encourage you to be creative!  To share your links, you can use actual text copy or embed the affiliate link into an image or video. The program is flexible with most methods of promotion. Most of our partners see the most success sharing links on bigger platforms, like TikTok, YouTube, Instagram, Facebook, and Twitter. You can also use your own website if you have one.  Creative assets are available in Impact. If you need additional data, case studies, or images, please reach out: info@nobltravel.com.","button-url":"","button-text":""}},"faq_item_76mBcW":{"type":"faq_item","settings":{"faq_question":"How do I receive payment?","faq_answer":"Commissionable conversions are captured in real-time and will be reflected in your Impact Publisher account. When an action comes through via your affiliate link, you will be able to actively monitor your performance and review commissions earned. In terms of when you will get paid, commissionable actions lock 15 days after the day they are tracked. Since TikTok wants to ensure partners are paid quickly, actions are approved 15 days after they lock.   For more information on payment processing, please review our \"How Are Partner Payments Processed?\" article below.","button-url":"","button-text":""}},"faq_item_NTbfFj":{"type":"faq_item","settings":{"faq_question":"Is there any reporting I can see to monitor my affiliate performance?","faq_answer":"Yes! Impact provides a variety of performance reports. You can monitor your performance in your Impact account, under Reports → Performance.","button-url":"","button-text":""}}},"block_order":["faq_item_hznGCV","faq_item_GJD7D4","faq_item_76mBcW","faq_item_NTbfFj"],"settings":{"faq_head":"How does it work?","faq_subhead":""}},"image_with_text_affiliation_mMkFLP":{"type":"image-with-text-affiliation","settings":{"mobile_main_image":"shopify:\/\/shop_images\/tipdilz7wysq-6e8dGVR9TblsdNvOKCKPr0_1.png","heading_text":"Become a","subheading_text":"Affiliate Partner today!","affiliate_button_text":"Apply Now","affiliate_link":"shopify:\/\/pages\/contact","agency_button_text":"","agency_link":"shopify:\/\/pages\/contact","main_image":"shopify:\/\/shop_images\/tipdilz7wysq-6e8dGVR9TblsdNvOKCKPr0_1.png","image_alt_text":"affiliation"}}},"order":["main","image_with_text_affiliate_eFpYVx","faq_affiliate_3Qnxci","image_with_text_affiliation_mMkFLP"]}