{"sections":{"main":{"type":"main-page","settings":{"show_title":true,"page_width":"xs"}},"rich_text_alt_YVGHGE":{"type":"rich-text-alt","blocks":{"richtext_tqA7pf":{"type":"richtext","settings":{"content":"<h3>Refunds<\/h3><p>We offer 100- Day Returns with 100% money back guarantee on all products that are defective or damaged during shipping. Just let us know and we will provide a return address, replacement or refund as preferred.<\/p><p>*Please note, if your order arrives defective, damaged or missing items\/orders must be made within 7 days after the date of delivery. We will still honor unused items within the 100 days from delivery.<\/p><p> <\/p><h3>Returns<\/h3><p>If you are unsatisfied with your order – please contact our support and we will do our best to help you out!<\/p><p>Customers will be responsible for paying return shipping costs.<\/p><p>We do not issue the refund if your order does not arrive due to factors within your control (e.g. providing the wrong shipping address).<\/p><p>If your return item arrives without the box, or is deemed unfit by our inspection team for any reason we reserve the right to deny your refund.<\/p><p>We will notify you once we’ve received and inspected your return. If approved, you’ll be automatically refunded on your original payment method. Please, allow up to 5 business days for your financial institution to process the refund.<\/p><h3>Refund Policy<\/h3><p>We have a 100-day return policy. You must make a refund request within 7 days of receiving the item if there's an issue with the products. You must ship the return within 100 days from when you received the item or you may not be eligible for a refund. <\/p><p>To be eligible for a return, your item must be in the same condition that you received it, or unused, with tags, and in its original packaging. You’ll also need the receipt or proof of purchase.<\/p><p>To start a return, you can contact us at hello@nobltravel.com If your return is accepted, we’ll send you instructions on how and where to send your package. Items sent back to us without first requesting a return will not be accepted. 5% restocking fee will be deducted from each return.<\/p><p><br\/><br\/>Feel free to contact us about any inquiries or concerns at hello@nobltravel.com<br\/><\/p><p> <\/p><p><strong>Nobl Travel Lifetime Warranty<\/strong><\/p><p>Thank you for choosing Nobl. We want you to love your Nobl luggage and not have to worry about it replacing it one day. We are so confident with the quality of all Nobl luggage that we are offering a lifetime warranty that will cover you if anything ever goes wrong. No questions asked. <\/p><p><strong>1. Warranty Coverage:<\/strong><\/p><ul><li>Nobl provides a lifetime warranty coverage for all luggage.<\/li><li>The warranty covers defects in materials and workmanship under normal use and proper maintenance.<\/li><li>The warranty extends for a lifetime period and will not expire.<\/li><\/ul><p><strong>2. What is Covered:<\/strong><\/p><ul><li>Defects in materials or workmanship that result in the inability to use Nobl Luggage as intended.<\/li><li>Malfunctions of the luggage, wheels or other essential components.<\/li><li>Structural defects that compromise the integrity or functionality of the luggage.<\/li><\/ul><p><strong>3. What is Not Covered:<\/strong><\/p><ul><li>Damage caused by misuse, abuse, neglect, or accident.<\/li><li>Normal wear and tear, including scratches, dents, or cosmetic damage.<\/li><li>Damage resulting from improper maintenance, cleaning, or storage.<\/li><li>Damage caused by using the product for purposes other than those intended or recommended by Nobl.<\/li><\/ul><p><strong>4. Warranty Claim Process:<\/strong><\/p><ul><li>To make a warranty claim, please contact Nobl Customer Service at hello@nobltravel.com<\/li><li>You will be required to provide proof of purchase. <\/li><li>Nobl reserves the right to assess the claim and determine whether the issue is covered under the warranty.<\/li><li>If the claim is approved, Nobl will send you a new luggage for no extra cost.<\/li><\/ul><p><strong>7. Transferability:<\/strong><\/p><ul><li>This warranty is valid only for the original purchaser of the Nobl order and is not transferable.<\/li><\/ul><p> <\/p><p>By purchasing from Nobl Travel, you agree to be bound by the terms and conditions of this warranty policy. If you have any questions or concerns regarding the warranty, please contact Nobl Customer Service for assistance. Thank you for choosing Nobl.<\/p><p> <\/p>"}}},"block_order":["richtext_tqA7pf"],"disabled":true,"settings":{"separate_section_with_border":true,"content_width":"xs","text_position":"start","remove_vertical_spacing":true}}},"order":["main","rich_text_alt_YVGHGE"]}